[
	{
		"id": 0,
		"location": "TX Tech University, Lubbock, TX",
		"title": "Academic Tutor",
		"date": "Jan 2020 - May 2020",
		"description": [
			"Tutored over 20 students with coursework related to the subject Discrete-Time Signals and Systems",
			"Assisted students with their written assignments, homeworks, quizzes and tests"
		],
		"technologies": []
	},
	{
		"id": 1,
		"location": "ULabs Makerspace, Lubbock, TX",
		"title": "Research Development Intern",
		"date": "Dec 2019 - Apr 2020",
		"description": [
			"Spearheaded the development of a Full Stack voting portal from scratch",
			"Implemented Google OAuth 2.0 API calls to securely login new and existing users to the platform",
			"Utilized Flask & PostgreSQL Stack to store user information and the voting data"
		],
		"technologies": ["python", "database"]
	},
	{
		"id": 2,
		"location": "Credit Suisse, Morrisville, NC",
		"title": "Software Developer",
		"date": "Sept 2021 - Nov 2023",
		"description": [
			"As a part of the CAPRI Team in Credit Suisse, I was responsible for migrating batch applications running on legacy servers into robust CSL3 (Cloud Services Lab) Red Hat Servers.",
			"Developed a Kafka Application to read, process, and publish internal Affirm Messages making massive utilization of Oracle and Mongo for persistence.",
			"This application was responsible for backfilling CNS (Continuous Net Settlement) Customer Trades."
		],
		"technologies": [
			"java",
			"springboot",
			"oracle",
			"kafka",
			"shell",
			"scripting"
		]
	},
	{
		"id": 3,
		"location": "MetLife, Cary, NC",
		"title": "Full Stack Software Developer",
		"date": "Jan 2024 - Present",
		"description": [
			"CDF Modernization – Case Definition Facility (CDF) is an insurance application used to formulate plans, rates and structures for a specific customer/organization.",
			"As part of the modernization efforts, I am responsible for migrating the legacy CDF App into robust, cloud-native applications on the Azure platform.",
			"This includes retiring applications running on the .NET Thick Client (Citrix) and reimplementing all functionalities using Spring Boot Web APIs.",
			"Additionally, I have been a part of developing user interfaces with React to enhance usability, simplify and modernize the overall user experience."
		],
		"technologies": [
			"java",
			"sql",
			"springboot",
			"db2",
			"react",
			"html5",
			"css3",
			"azure",
			"docker"
		]
	}
]
